Tauser/noisebot/sdkconfig.defaults
# NoiseBot — sdkconfig.defaults
# Aplicado sobre os defaults do ESP-IDF. Não editar sdkconfig diretamente.
# Para sobrescrever localmente: criar sdkconfig.defaults.local (não versionado).

# ── Target ────────────────────────────────────────────────────────────────────
CONFIG_IDF_TARGET="esp32s3"

# ── CPU ───────────────────────────────────────────────────────────────────────
CONFIG_ESP32S3_DEFAULT_CPU_FREQ_240=y

# ── Flash ─────────────────────────────────────────────────────────────────────
CONFIG_ESPTOOLPY_FLASHSIZE_16MB=y
CONFIG_ESPTOOLPY_FLASHMODE_QIO=y
CONFIG_ESPTOOLPY_FLASHFREQ_80M=y

# ── Partition table ───────────────────────────────────────────────────────────
CONFIG_PARTITION_TABLE_CUSTOM=y
CONFIG_PARTITION_TABLE_CUSTOM_FILENAME="partitions.csv"

# ── PSRAM (octal SPI, 8MB) ────────────────────────────────────────────────────
CONFIG_SPIRAM=y
CONFIG_SPIRAM_MODE_OCT=y
CONFIG_SPIRAM_SPEED_80M=y
CONFIG_SPIRAM_USE_CAPS_ALLOC=y
CONFIG_SPIRAM_MALLOC_ALWAYSINTERNAL=16384
# Reservar headroom de PSRAM para câmera futura (~300KB).
# Monitorar uso via heap_caps_get_free_size(MALLOC_CAP_SPIRAM) em produção.

# ── Brownout ──────────────────────────────────────────────────────────────────
CONFIG_ESP_BROWNOUT_DET=y
# Nível 0 ≈ 2.44V no rail de 3.3V — conservador. Ajustar empiricamente
# se houver resets espúrios com protoboard. Níveis: 0–7 (0=mais sensível).
CONFIG_ESP_BROWNOUT_DET_LVL_SEL_0=y

# ── Watchdog ──────────────────────────────────────────────────────────────────
CONFIG_ESP_TASK_WDT_EN=y
CONFIG_ESP_TASK_WDT_INIT=y
CONFIG_ESP_TASK_WDT_TIMEOUT_S=5
# Não monitorar idle tasks — o watchdog monitora as tasks críticas via código.
CONFIG_ESP_TASK_WDT_CHECK_IDLE_TASK_CPU0=n
CONFIG_ESP_TASK_WDT_CHECK_IDLE_TASK_CPU1=n
# Panic em WDT timeout: gera coredump e reseta.
CONFIG_ESP_TASK_WDT_PANIC=y

# ── FreeRTOS ──────────────────────────────────────────────────────────────────
CONFIG_FREERTOS_HZ=1000
CONFIG_FREERTOS_USE_TRACE_FACILITY=y
CONFIG_FREERTOS_GENERATE_RUN_TIME_STATS=y

# ── Log ───────────────────────────────────────────────────────────────────────
CONFIG_LOG_DEFAULT_LEVEL_INFO=y
CONFIG_LOG_MAXIMUM_LEVEL_DEBUG=y
# Em produção, usar CONFIG_LOG_DEFAULT_LEVEL_WARN para reduzir overhead UART.

# ── NVS ───────────────────────────────────────────────────────────────────────
CONFIG_NVS_ENCRYPTION=n

# ── SPI / Display ─────────────────────────────────────────────────────────────
# LovyanGFX controla o SPI diretamente via driver de baixo nível.
# Não usar CONFIG_SPI_MASTER_IN_ISR — LovyanGFX gerencia DMA.

# ── WiFi / BT — DESABILITADOS (offline-first) ─────────────────────────────────
# WiFi e BT não são desabilitados via sdkconfig.defaults — no ESP-IDF 5.x
# eles são controlados pela inclusão (ou não) do componente esp_wifi/bt nos
# REQUIRES do CMakeLists. Nenhum componente do projeto inclui esp_wifi.
# WiFi será incluído somente no Bloco 7 (OTA).

# ── Stack mínimo de tasks ─────────────────────────────────────────────────────
CONFIG_ESP_MAIN_TASK_STACK_SIZE=4096

# ── Coredump (diagnóstico em crash) ──────────────────────────────────────────
CONFIG_ESP_COREDUMP_ENABLE_TO_UART=y
CONFIG_ESP_COREDUMP_DATA_FORMAT_ELF=y
